[Demo_Ekoro_End_bad GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-890,Y=1067,Z=1335),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=179,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Vec=(X=-1050,Y=1070,Z=1200),VecSub=(X=0,Y=0,Z=0),CId=21)
DemoScripts[4]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-1170,Y=900,Z=-1200),VecSub=(X=30,Y=0,Z=0),CId=71)
DemoScripts[5]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[6]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0000_lp_open_normal",motionName[1]="pt_CM_0000_fx_close_normal",motionName[2]="pt_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[7]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0400_lp_disgusted",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_1100_lp_Proud",Rate=1,Number=3,Bit=5)
DemoScripts[8]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Serious_Ekoro.GG2_BGM_DM_Serious_Ekoro_Cue')
DemoScripts[9]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Rooftop.GG2_AMB_Rooftop_LP_Cue')
DemoScripts[10]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[11]=(Actor=FADE,Command=WAIT)
DemoScripts[12]=(Actor=WINDOW,Command=SET)
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[14]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_002_Cue',Name="アマツカ　パタコ")
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[16]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[18]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[19]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[20]=(Actor=BGM,Command=PLAY,SecTime=1,SoundID=SoundCue'GG2_BGM_DM_CMN_Uneasy.GG2_BGM_DM_CMN_Uneasy_Cue')
DemoScripts[21]=(Actor=EMOTION,Command=SET,Name="アマツカ　パタコ",Number=3,CId=21)
DemoScripts[22]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Wonder_Cue')
DemoScripts[23]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_004_Cue',Name="アマツカ　パタコ")
DemoScripts[24]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[25]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[27]=(Actor=WINDOW,Command=EXIT)
DemoScripts[28]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=330,Y=-5,Z=0),SecTime=1)
DemoScripts[29]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[30]=(Actor=WINDOW,Command=SET)
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[32]=(Actor=WINDOW,Command=EXIT)
DemoScripts[33]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=179,Y=-5,Z=0),SecTime=0.5)
DemoScripts[34]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[35]=(Actor=WINDOW,Command=SET)
DemoScripts[36]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[37]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[38]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[1]="pt_CM_0000_fx_close_normal",Rate=1,Number=1,Bit=0)
DemoScripts[39]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_008_Cue',Name="アマツカ　パタコ")
DemoScripts[40]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[41]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[42]=(Actor=CHARACTER,Command=SET,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=POS,Vec=(X=-1170,Y=900,Z=1200),CId=71)
DemoScripts[43]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_009_Cue',Name="エコロ")
DemoScripts[44]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[45]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[46]=(Actor=WINDOW,Command=EXIT)
DemoScripts[47]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=200,Y=-5,Z=0),SecTime=0.5)
DemoScripts[48]=(Actor=CHARACTER,Command=MOVE,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=ROT,Vec=(X=200,Y=0,Z=0),SecTime=0.5,CId=21)
DemoScripts[49]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[50]=(Actor=WINDOW,Command=SET)
DemoScripts[51]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_010_Cue',Name="アマツカ　パタコ")
DemoScripts[52]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[53]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[54]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[55]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=5,CId=71)
DemoScripts[56]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Anger_Cue')
DemoScripts[57]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0201_lp_half_angry",Rate=1,Number=0,Bit=1)
DemoScripts[58]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_012_Cue',Name="エコロ")
DemoScripts[59]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[60]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[61]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Bit=1,Number=5)
DemoScripts[62]=(Actor=SOUND_EX,Command=PLAY,SecTime=1,SoundID=SoundCue'SE_DM_Ekoro_End_bad.GG2_SE_DM_Dark_Aura_LP_Cue')
DemoScripts[63]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_013_Cue',Name="アマツカ　パタコ")
DemoScripts[64]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[65]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[66]=(Actor=WINDOW,Command=EXIT)
DemoScripts[67]=(Actor=FADE,Command=SET,SecTime=0.5,FadeColor=FADE_COLOR_BLACK,FadePriority=FADE_PRIO_FRONT)
DemoScripts[68]=(Actor=FADE,Command=WAIT)
DemoScripts[69]=(Actor=TEXTURE,Command=START,CId=22,Bit=0,Number=0,Vec=(X=,Y=,Z=))
DemoScripts[70]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[71]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[72]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_Boss.GG2_BGM_Boss_Cue')
DemoScripts[73]=(Actor=FADE,Command=EXIT,SecTime=0.5,FadeColor=FADE_COLOR_BLACK,FadePriority=FADE_PRIO_FRONT)
DemoScripts[74]=(Actor=FADE,Command=WAIT)
DemoScripts[75]=(Actor=GALLERY,Command=SET_FLAG,CId=22,Bit=0)
DemoScripts[76]=(Actor=WINDOW,Command=SET)
DemoScripts[77]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_014_Cue',Name="エコロ")
DemoScripts[78]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[79]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[80]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_015_Cue',Name="アマツカ　パタコ")
DemoScripts[81]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[82]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[83]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[84]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_017_Cue',Name="アマツカ　パタコ")
DemoScripts[85]=(Actor=TEXT,Command=SET,ID=TEXT17)
DemoScripts[86]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[87]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_018_Cue',Name="アマツカ　パタコ")
DemoScripts[88]=(Actor=TEXT,Command=SET,ID=TEXT18)
DemoScripts[89]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[90]=(Actor=TEXT,Command=SET,ID=TEXT19)
DemoScripts[91]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_020_Cue',Name="アマツカ　パタコ")
DemoScripts[92]=(Actor=TEXT,Command=SET,ID=TEXT20)
DemoScripts[93]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[94]=(Actor=TEXT,Command=SET,ID=TEXT21)
DemoScripts[95]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_022_Cue',Name="エコロ")
DemoScripts[96]=(Actor=TEXT,Command=SET,ID=TEXT22)
DemoScripts[97]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[98]=(Actor=TEXT,Command=SET,ID=TEXT23)
DemoScripts[99]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Ekoro_End_bad.GG2_SE_DM_Crow_Cue')
DemoScripts[100]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_End_bad.GG2_V_Ekoro_End_bad_024_Cue',Name="アマツカ　パタコ")
DemoScripts[101]=(Actor=TEXT,Command=SET,ID=TEXT24)
DemoScripts[102]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[103]=(Actor=WINDOW,Command=EXIT)
DemoScripts[104]=(Actor=FADE,Command=SET,SecTime=2,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[105]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[106]=(Actor=SOUND_EX,Command=STOP,SecTime=1,SoundID=)
DemoScripts[107]=(Actor=AMBIENT,Command=STOP,SecTime=1,SoundID=)
DemoScripts[108]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[109]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[110]=(Actor=SYSTEM,Command=END)

[Select_Ekoro_End_bad GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Ekoro_End_bad GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="到屋頂了!/n接下來該做什麼呢?")

Texts[1]=(Label="TEXT02",Name="帕塔可",Text="好的,條件已經湊齊了./n......咦,奇怪?")

Texts[2]=(Label="TEXT03",Name="峯大",Text="怎麼了嗎?")

Texts[3]=(Label="TEXT04",Name="帕塔可",Text="那個......峯大大人?/n艾可蘿她......怎麼了?")

Texts[4]=(Label="TEXT05",Name="峯大",Text="咦?/n艾可蘿的話,我背在背上......")

Texts[5]=(Label="TEXT06",Name="峯大",Text="奇怪?")

Texts[6]=(Label="TEXT07",Name="峯大",Text="什麼時候......掉下去了......?")

Texts[7]=(Label="TEXT08",Name="帕塔可",Text="你你你你......你在搞什麼啊--!!")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="......終於找到囉./n你們兩位,未免太過分了吧......")

Texts[9]=(Label="TEXT10",Name="帕塔可",Text="艾可蘿!")

Texts[10]=(Label="TEXT11",Name="峯大",Text="妳沒事啊!")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="沒事......哪裡沒事了......?/n把我排擠在外......")

Texts[12]=(Label="TEXT13",Name="帕塔可",Text="欸......奇怪?/n樣子好像......")

Texts[13]=(Label="TEXT14",Name="艾可蘿",Text="我不會原諒你們......絕對不....../n抹殺! 要抹殺掉!!")

Texts[14]=(Label="TEXT15",Name="帕塔可",Text="為什麼連我也要--!?")

Texts[15]=(Label="TEXT16",Name="峯大",Text="帕......帕塔可!/n快想點辦法啊!!")

Texts[16]=(Label="TEXT17",Name="帕塔可",Text="辦不到!/n艾可蘿的心已經完全/n離開峯大大人了!")

Texts[17]=(Label="TEXT18",Name="帕塔可",Text="這樣的話,/n淨化儀式也不管用了!")

Texts[18]=(Label="TEXT19",Name="峯大",Text="咦咦--!?")

Texts[19]=(Label="TEXT20",Name="帕塔可",Text="都是峯大大人的錯啦!/n為什麼會弄掉她啊!?")

Texts[20]=(Label="TEXT21",Name="峯大",Text="不......這個,因為實在太平,/n背後完全沒有觸感......")

Texts[21]=(Label="TEXT22",Name="艾可蘿",Text="呵......呵呵呵呵呵....../n我要狠狠宰了峯大!!")

Texts[22]=(Label="TEXT23",Name="峯大",Text="糟......糟糕!/n不應該說太平,而是要說太輕才對!!")

Texts[23]=(Label="TEXT24",Name="帕塔可",Text="問題不在那裡--!!")

Texts[24]=(Label="",Name="",Text="")

Texts[25]=(Label="SELECT01",Name="",Text="")

Texts[26]=(Label="SELECT02",Name="",Text="")

Texts[27]=(Label="SELECT03",Name="",Text="")

Texts[28]=(Label="SELECT04",Name="",Text="")

Texts[29]=(Label="SELECT05",Name="",Text="")

Texts[30]=(Label="SELECT06",Name="",Text="")

Texts[31]=(Label="SELECT07",Name="",Text="")

Texts[32]=(Label="SELECT08",Name="",Text="")

Texts[33]=(Label="SELECT09",Name="",Text="")

Texts[34]=(Label="SELECT10",Name="",Text="")


